音高频率表 = {
	"c": 261.63,  # C4
	"d": 293.66,  # D4
	"e": 329.63,  # E4
	"f": 349.23,  # F4
	"g": 392.00,  # G4
	"a": 440.00,  # A4
	"b": 493.88   # B4
}


# 采样率选项信息源自chatgpt
# 　　电话质量：8    kHz，通常用于电话系统和语音通信。
# 　　标准质量：16   kHz，用于语音识别和一般音频录制。
# 　　光碟音质：44.1 kHz，用于音乐CD。
# 　　专业音频：48   kHz，用于音乐制作和数字音频工作站。
# 　高保真音频：96   kHz，用于专业音乐制作和高分辨率音频录制。
# 超高保真音频：192  kHz，用于专业音乐制作和高端音频设备。
常用采样率 = {
	"8k":     8000,
	"16k":   16000,
	"44.1k": 44100,
	"48k":   48000,
	"96k":   96000,
	"192k":  19200,
}